//AD07288A JOB (HELLO),'ADRIAN HARDY',MSGLEVEL=(1,1),
//         CLASS=T,
//         MSGCLASS=X,
//         NOTIFY=&SYSUID
//GO      EXEC PGM=MAIN
//STEPLIB DD DSN=AD07288.DBBSAMP.BUILD.LOAD,
//        DISP=SHR
//SYSOUT       DD SYSOUT=*
//SYSUDUMP     DD SYSOUT=*