       01 ACCOUNT.
           05 ACCOUNT-BALANCE PIC 9(15) VALUE 0.
           05 ACCOUNT-NUMBER PIC 9(11) VALUE 0.
           05 ACCOUNT-TYPE PIC X(7) VALUE SPACES.
           05 ACCOUNT-PRODUCT PIC X(8) VALUE SPACES.
           05 ACCOUNT-BSU-SAVINGS PIC 9(15) VALUE 0.