       01 AMOUNT-TRANSACTION.
           05 TRANSACTION-CODE PIC 99 VALUE 0.
           05 TRANSACTION-CLASS PIC X VALUE SPACES.
           05 TRANSACTION-TYPE PIC 99 VALUE 0.
           05 TRANSACTION-AMOUNT PIC 9(15) VALUE 0.
           05 TRANSACTION-FROM-ACCOUNT PIC 9(11) VALUE 0.
           05 TRANSACTION-TO-ACCOUNT PIC 9(11) VALUE 0.