       cbl pgmname(lm)
       Identification Division.
       Program-Id. "HelloWorld".

       Procedure Division.
           Display "Hello World!"
           Goback.